const TYPE_MENU = new Map([
  ['에피타이저', ['양송이수프', '타파스', '시저샐러드']],
  ['메인', ['티본스테이크', '바비큐립', '해산물파스타', '크리스마스파스타']],
  ['디저트', ['초코케이크', '아이스크림']],
  ['음료', ['제로콜라', '레드와인', '샴페인']],
]);

const MENU_PRICE = new Map([
  ['양송이수프', 6000],
  ['타파스', 5500],
  ['시저샐러드', 8000],
  ['티본스테이크', 55000],
  ['바비큐립', 54000],
  ['해산물파스타', 35000],
  ['크리스마스파스타', 25000],
  ['초코케이크', 15000],
  ['아이스크림', 5000],
  ['제로콜라', 3000],
  ['레드와인', 60000],
  ['샴페인', 25000],
]);

const CALENDAR = new Map([
  ['평일', [3, 4, 5, 6, 7, 10, 11, 12, 13, 14, 17, 18, 19, 20, 21, 24, 25, 26, 27, 28, 31]],
  ['주말', [1, 2, 8, 9, 15, 16, 22, 23, 29, 30]],
  ['특별', [3, 10, 17, 24, 25, 31]],
]);

export { TYPE_MENU, MENU_PRICE, CALENDAR };
